# class with information about training
class WorkoutProgram
  def program_1
    "Тренировка1
    Размминка(каридо 10-15 мин, пресс + гиперэкстензия 3х15, упр Bird Dog)
    1. Махи гири/блина/гантели 3х15
    2. Тяга горизонтальная 3х20
    3. Присед с выходом на носки 3х30
    4. Тяга вертикальная 3х20
    5. Отжимания/жим в тренажере 3х15
    6. Отведение бедра сидя в тренажере 3х30"
  end

  def program_2
    "Тренировка2
    Размминка(каридо 10-15 мин, пресс + гиперэкстензия 3х15, упр Bird Dog)
    1. Присед с вертикальным жимом гантель 4х10
    2. Тяга вертикальная 4х10
    3. Отжимания/жим в тренажере 4х10
    4. Тяга на одной ноге(вторая отставлена назад) + тяга горизонтальная с гантелью/блином 4х10
    5. Приведение бедра сидя в тренажере 4х20"
  end

  def program_3
    "Тренировка3
    Размминка(каридо 10-15 мин, пресс + гиперэкстензия 3х15, упр Bird Dog)
    1. Тяга Кинга 4х15
    2. Разгибание голени 3х15
    3. Сгибание голение 3х15
    4. Отведение бедра сидя в тренажере 5х10
    5. Жим платформы одной ногой 4х15
    6. Приведение бедра сидя в тренажере 5х10"
  end

  def program_4
    "Тренировка4
    Размминка(каридо 10-15 мин, пресс + гиперэкстензия 3х15, упр Bird Dog)
    1. Махи гири/блина/гантели 4х10
    2. Тяга горизонтальная 4х10
    3. Присед с выходом на носки 4х15
    4. Тяга вертикальная 4х10
    5. Отжимания/жим в тренажере 4х8
    6. Отведение бедра сидя в тренажере 4х20"
  end

  def program_5
    "Тренировка5
    Размминка(каридо 10-15 мин, пресс + гиперэкстензия 3х15, упр Bird Dog)
    1. Присед с вертикальным жимом гантель 3х15
    2. Тяга вертикальная 3х12
    3. Отжимания/жим в тренажере 3х12
    4. Тяга на одной ноге(вторая отставлена назад) + тяга горизонтальная с гантелью/блином 3х15
    5. Приведение бедра сидя в тренажере 3х15"
  end

  def program_6
    "Тренировка6
    Размминка(каридо 10-15 мин, пресс + гиперэкстензия 3х15, упр Bird Dog)
    1. Тяга Кинга 3х20
    2. Разгибание голени 4х10
    3. Сгибание голение 4х10
    4. Отведение бедра сидя в тренажере 4х15
    5. Жим платформы одной ногой 3х20
    6. Приведение бедра сидя в тренажере 4х15"
  end
end
